## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_role_assignment.observe_role_assignment will be created
  + resource "azurerm_role_assignment" "observe_role_assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "da7482c0-e476-47d2-8755-25dd369e4421"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/080291cf-8419-427c-953c-944e6c351029"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>